[
  {
    "id": 1,
    "title": "An Ecommerce Website",
    "description": "This e-commerce website project, developed using Next.js, MongoDB, Tailwind CSS, OAuth authentication, React.js, GSAP, and AWS, showcases a modern and responsive online shopping platform. It features secure user registration and login with OAuth (Google), a dynamic product catalog, a persistent shopping cart, and a streamlined checkout process, though no payment gateway is integrated. The site includes an admin dashboard for managing products, orders, and users, and employs GSAP for interactive animations. Deployed on Vercel, the project ensures fast load times and a consistent user experience across devices.",
    "link": "https://github.com/sambhav874/UrbanZeal"
  },
  {
    "id": 2,
    "title": "DocMaker Web Application",
    "description": "DocMaker is a web application built using Next.js and ShadCN for document creation and collaboration. It offers features such as text formatting, file uploads, and user authentication through Clerk. The interface is designed to be responsive and optimized for various screen sizes, ensuring a smooth experience for users.",
    "link": "https://github.com/sambhav874/DocMaker"
  },
  {
    "id": 3,
    "title": "Java Electronic Trading Matching Engine",
    "description": "At the heart of our trading platform lies a sophisticated Java-based stock matching engine, a culmination of numerous interactions and collaborative meetings. Orchestrating seamless trade execution, this engine interacts within the financial landscape using the renowned FIX protocol, ensuring transaction integrity and reliability. FIX (Financial Information eXchange) protocol, the industry-standard messaging framework, facilitates real-time communication among market participants. Operating in a multithreaded environment, this engine employs parallel processing for efficient trade execution. It concurrently processes multiple incoming orders, ensuring rapid and precise trade matching while maintaining trading process consistency.",
    "link": "https://github.com/sambhav874/ElectronicTrading"
  },
  {
    "id": 4,
    "title": "WallGen - Crypto-Management-Platform",
    "description": "A comprehensive decentralized application (dApp) built with Next.js, TypeScript, and Tailwind CSS for managing Solana-based wallets and tokens. This platform allows users to donate, generate wallets, explore transactions, request airdrops, create tokens, and fetch token metadata.",
    "link": "https://github.com/sambhav874/WallGen-Crypto-Management-Platform"
  },
  {
    "id": 5,
    "title": "Home Loan Website",
    "description": "This website provides users with an intuitive interface to explore home loan options. Built with Next.js, Tailwind CSS, and ShadCN, it offers loan comparison tools, interest rate calculators, and a responsive design that works seamlessly across devices.",
    "link": "https://github.com/sambhav874/BankersAdda-Home-Loan-Website"
  },
  {
    "id": 6,
    "title": "Java Data Structures and Algorithms",
    "description": "Passionate about building scalable and high-performance software systems, I have demonstrated expertise in Java programming, data structures, and algorithm design. Experienced in solving complex problems efficiently, I have implemented essential data structures and algorithms in Java. Through the use of linked lists, stacks, queues, trees, graphs, and hash tables, I have developed robust solutions. My focus on performance optimization has involved leveraging memoization and efficient data structures. I have thoroughly tested and documented the solutions.",
    "link": "https://github.com/sambhav874/JavaDataStructuresAndAlgoS"
  },
  {
    "id": 7,
    "title": "Portfolio Using MERN",
    "description": "This portfolio website project, built using the MERN stack (MongoDB, Express.js, React.js, and Node.js), showcases a developer's professional skills, projects, and achievements in a modern and interactive way. The site features a dynamic and responsive design, enabling users to easily navigate through different sections such as About Me, Projects, Skills, and Contact. MongoDB serves as the database to store project details and user messages, while Express.js and Node.js provide a robust backend to handle API requests and server-side operations.",
    "link": "https://sambhavj874.netlify.app/"
  },
  {
    "id": 8,
    "title": "Eventia - Event Management Platform",
    "description": "Eventia is an event management and booking platform built using Next.js and GSAP for animations. It provides features such as event creation, booking, and management, while ensuring a responsive and intuitive user experience. The platform is optimized for performance with a dark theme and a modern UI.",
    "link": "https://github.com/sambhav874/Eventia"
  },
  {
    "id": 9,
    "title": "Simple Stock Predicting Model",
    "description": "The basic stock predicting web app, developed in Python, employs the Facebook forecasting model, fbprophet, and is showcased through the Streamlit framework. This user-friendly application allows users to input historical stock price data, customize forecasting parameters, and visualize predicted stock prices dynamically.",
    "link": "https://github.com/sambhav874/SimpleStockPredictingModel"
  },
  {
    "id": 10,
    "title": "Flipkart Front End Clone",
    "description": "The design and layout of the Flipkart clone mirrors the original platform's aesthetics, ensuring a seamless and intuitive shopping experience for users. Implementing responsive design principles ensures a consistent and visually appealing display across various devices.",
    "link": "https://github.com/sambhav874/Flipkart_CloneHP"
  },
  {
    "id": 11,
    "title": "Spotify Front End Clone",
    "description": "Creating a front-end Spotify clone focused on replicating the engaging and user-friendly interface of the renowned music streaming platform. This project involves leveraging front-end technologies to design and implement features that mimic the core functionalities of Spotify.",
    "link": "https://github.com/sambhav874/Spotify-Clone"
  }
]